JasonExample/src/test/ProtectedSOAPRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wsssecurity-utility-1.0.xsd"
	xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:wsse="docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wsssecurity-secext-1.0.xsd">
	<soap:Header>
		<wsse:Security>
			<ds:Signature>
				<ds:SignedInfo>
					<ds:DigestValue>k3453rvEPO0vKtMup4NbeVu8nk=</ds:DigestValue>
				</ds:SignedInfo>
				<ds:Object ID="fromAccountID"/>
			</ds:Signature>
			<ds:Signature>
				<ds:SignedInfo>
					<ds:DigestValue>k34fewfkwwowVu8nk=</ds:DigestValue>
				</ds:SignedInfo>
				<ds:Object ID="toAccountID"/>
			</ds:Signature>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<transfer xmlns="http://cs.ru.nl/~brinkman/ns/example">
			<fromAccount wsu:ID="fromAccountID">6808755</fromAccount>
			<toAccount wsu:ID="toAccountID">284537759</toAccount>
			<xenc:EncryptedData>
				<xenc:CipherData>
					<xenc:CipherValue>JFJOQ4JEF63FF2J4QEFQ=</xenc:CipherValue>
				</xenc:CipherData>
			</xenc:EncryptedData>
		</transfer>
	</soap:Body>
</soap:Envelope>
